print(2 * 3)
print(182837474 * 74832972)

print(477 - 47)

print(829 + 83248392)

print(100 + 2 * 4)
print((100 + 2) * 4)

# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления:
print(11111 * 1111111)

# Целочисленное деление и остаток (используется для деления на десятки путем операций с 10, 100 и тд)

print(42 // 8)
print(42 % 8)

# Возведение в степень (0.5 - квадратный корень)

print(5 ** 3)
print(9 ** 0.5)

# Составьте выражение для вычисления в интерпретаторе Python 3 и вставьте в поле ответа результат вычисления: 2014^14
a = 2014 ** 14

# Числа с плавающей точкой
print(a + 0.3 + 0.234)

# могут быть ошибки в вычислениях
print(0.3 + 0.3 + 0.3)

# можно представлять числа в виде степени е
print(5e-2)
print(123e+4)
